per1234/InoPlatformPropertiesTest/avr/boards.txt
PlatformPropertiesTest.name=PlatformPropertiesTest

PlatformPropertiesTest.upload.tool=dummy_tool
PlatformPropertiesTest.upload.protocol=arduino
PlatformPropertiesTest.upload.maximum_size=32256
PlatformPropertiesTest.upload.maximum_data_size=2048
PlatformPropertiesTest.upload.speed=115200

PlatformPropertiesTest.bootloader.tool=dummy_tool
PlatformPropertiesTest.bootloader.low_fuses=0xFF
PlatformPropertiesTest.bootloader.high_fuses=0xDE
PlatformPropertiesTest.bootloader.extended_fuses=0xFD
PlatformPropertiesTest.bootloader.unlock_bits=0x3F
PlatformPropertiesTest.bootloader.lock_bits=0x0F
PlatformPropertiesTest.bootloader.file=optiboot/optiboot_atmega328.hex

PlatformPropertiesTest.build.mcu=atmega328p
PlatformPropertiesTest.build.f_cpu=16000000L
PlatformPropertiesTest.build.board=AVR_UNO
PlatformPropertiesTest.build.core=arduino:arduino
PlatformPropertiesTest.build.variant=arduino:standard
